{"format": "layers-model", "generatedBy": "keras v2.1.6", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dtype": "float32", "name": "conv2d_1", "activation": "relu", "filters": 32, "kernel_constraint": null, "batch_input_shape": [null, 28, 28, 1], "dilation_rate": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_2", "activation": "relu", "filters": 64, "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 128, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 10, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "softmax"}}]}, "training_config": {"optimizer_config": {"class_name": "Adadelta", "config": {"lr": 1.0, "epsilon": 1e-07, "rho": 0.95, "decay": 0.0}}, "loss_weights": null, "metrics": ["accuracy"], "sample_weight_mode": null, "loss": "categorical_crossentropy"}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv2d_1/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [9216, 128], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [128, 10], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [10], "dtype": "float32"}]}]}